# Дано целое число. Определить, заканчивается ли оно число цифрой 5?
# Формат входных данных: Целое положительно число
# Формат выходных данных: Если число оканчивается цифрой 5, вывести «YES», в противном случае — вывести «NO».
number = input("Введите целое положительное число")
if str(number)[-1] == '5'
   print("Число заканчивается на 5")  
elif str(number)[-1] != 5:
   print("Число на 5 не заканчивается")
  
# TODO: your code here
